## Terraform Checks
#### Format Check 📏`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_record.github_verify: Refreshing state... [id=d558bcc9b8770c150abf3935ad154aa7]
module.cloudflare-zerotrust.random_password.tunnel_secret: Refreshing state... [id=none]
digitalocean_spaces_bucket.nixos: Refreshing state... [id=yv7ed2uvapidf-nixos]
module.cloudflare-zerotrust.module.access_app_teleport.cloudflare_access_application.application: Refreshing state... [id=841c3752-517b-4601-9a3d-fa907fa06fc3]
module.static_site.digitalocean_app.site_app: Refreshing state... [id=1a016867-e984-4f55-a67e-687b0dc3f650]
module.cloudflare-zerotrust.cloudflare_record.access_app_teleport: Refreshing state... [id=34098c329765d26376137a953218500c]
module.cloudflare-zerotrust.cloudflare_device_dex_test.unifi: Refreshing state... [id=767925bd-58ff-46e0-876f-7ffa417125c5]
module.cloudflare-zerotrust.cloudflare_device_settings_policy.morrislan_settings: Refreshing state... [id=050d34664e05a4829fd68f1f884921be]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_windows_teleport: Refreshing state... [id=378474b0-8ad8-496b-a730-e821f7c9b40a]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_macos_teleport: Refreshing state... [id=ef6e75cf-6ab8-4f51-8161-19529e760d29]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_macos: Refreshing state... [id=b99d8690-693f-4a7d-bedf-08f2a270b2e0]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.firewall_macos: Refreshing state... [id=adf5c0d9-521c-4ea6-9ec0-0ee4fcb40571]
module.cloudflare-zerotrust.cloudflare_teams_rule.block_threats: Refreshing state... [id=a4115fc2-f6ed-4bb6-9bc1-e764cb03badb]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.github: Refreshing state... [id=3054c1ad-9a73-4638-8ebf-1782304d9f76]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.firewall_windows: Refreshing state... [id=e1def9b7-52b5-47c2-9b11-71e02e2c8625]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_android: Refreshing state... [id=b563f792-b506-4de6-942f-10014a232a7f]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.disk_encryption_windows: Refreshing state... [id=dd3e9a96-2428-462c-a08f-5ef02772bfa5]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.disk_encryption_macos: Refreshing state... [id=63e08031-4127-43b2-9ff8-3c25c271901b]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.gateway: Refreshing state... [id=20a2ba2e-1f2d-4d6b-94da-e810d845108a]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_ios: Refreshing state... [id=a07800e8-c0fa-4e25-a6f2-a31babbf773e]
module.cloudflare-zerotrust.cloudflare_teams_location.home: Refreshing state... [id=2b6bb98f19d84a7597c07bc9e42942be]
module.cloudflare-zerotrust.cloudflare_teams_rule.allow_morrislan: Refreshing state... [id=1bf69c43-4ef4-4247-80bf-233985d2f0d9]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.warp: Refreshing state... [id=023b1934-a799-4b40-b7b8-7510f5527b58]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_windows: Refreshing state... [id=82189582-a53b-47a6-bd21-4dc9b375bd8a]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.otp: Refreshing state... [id=89cdb541-1b94-4fd6-a544-87753f3fa6d2]
module.cloudflare-zerotrust.cloudflare_device_dex_test.status: Refreshing state... [id=2da89306-832a-4774-b86f-c856a3e0910a]
module.cloudflare-zerotrust.cloudflare_device_dex_test.ha: Refreshing state... [id=19d7952d-1f81-42f4-8876-1283e2b4032b]
module.cloudflare-zerotrust.cloudflare_tunnel.clancy: Refreshing state... [id=e22b33cc-010f-43d2-9261-73e99b46758c]
module.static_site.cloudflare_record.www_record[0]: Refreshing state... [id=4fc272899d878ba304f9166d4e9a5ac8]
module.static_site.cloudflare_record.root_record[0]: Refreshing state... [id=871856b74ac18eb9f7f69c212a9129e4]
module.static_site.digitalocean_project.site_project[0]: Refreshing state... [id=27ecab9a-b47f-4e38-a3bf-7f43c886e3a3]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_application.application: Refreshing state... [id=a48f1cd6-cf38-4e15-99de-a9711e6f1fc2]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_application.application: Refreshing state... [id=eff7a6ba-948e-4d6a-b790-76c2fb75f5ea]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_application.application: Refreshing state... [id=9940e328-2cad-4249-b8cd-da9fac6c46ef]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_policy.github_policy[0]: Refreshing state... [id=a660da7a-dd31-4d4f-b272-4a175167d3da]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_windows_unifi: Refreshing state... [id=82117874-a6d2-40bc-9d88-21f249417062]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_macos_unifi: Refreshing state... [id=f419cc6e-7e98-4724-b3b0-ab2cf1e3d14b]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_macos_ha: Refreshing state... [id=612224ec-f421-4ac8-a9ea-36625db610a9]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_android_ha: Refreshing state... [id=1a0cc2a6-1b99-40d7-8c7e-6b4830cd0fca]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_windows_ha: Refreshing state... [id=2598550f-2388-4cba-8a76-c3a49ce5ac2a]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_ios_ha: Refreshing state... [id=59870379-0998-4551-8cc4-0a50a87687f8]
module.cloudflare-zerotrust.cloudflare_record.access_app_unifi: Refreshing state... [id=92012367af159ab0ad79d3762cdac9bf]
module.cloudflare-zerotrust.cloudflare_record.access_app_status: Refreshing state... [id=a6d3393cfd891159652e32afe7ef8188]
module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy: Refreshing state... [id=e22b33cc-010f-43d2-9261-73e99b46758c]
module.cloudflare-zerotrust.cloudflare_record.access_app_ha: Refreshing state... [id=4316741f5653368d172de3d009f3b712]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.static_site.digitalocean_app.site_app has changed
  ~ resource "digitalocean_app" "site_app" {
      ~ active_deployment_id = "ff20804e-c318-4cb1-bc06-b3505fb2ce54" -> "889424f0-7725-4674-ba5d-e7534aa01e00"
        id                   = "1a016867-e984-4f55-a67e-687b0dc3f650"
      ~ updated_at           = "2023-12-26 14:29:45 +0000 UTC" -> "2023-12-26 14:53:59 +0000 UTC"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_macos_ssh_srv_access_01 will be created
  + resource "cloudflare_access_policy" "device_policy_macos_ssh_srv_access_01" {
      + account_id       = (known after apply)
      + application_id   = (known after apply)
      + decision         = "allow"
      + id               = (known after apply)
      + name             = "srv-access-01 SSH Device Policy (macOS)"
      + precedence       = 2
      + session_duration = "6h"
      + zone_id          = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + device_posture = [
              + "b99d8690-693f-4a7d-bedf-08f2a270b2e0",
            ]
        }

      + require {
          + device_posture = [
              + "20a2ba2e-1f2d-4d6b-94da-e810d845108a",
              + "023b1934-a799-4b40-b7b8-7510f5527b58",
              + "adf5c0d9-521c-4ea6-9ec0-0ee4fcb40571",
              + "63e08031-4127-43b2-9ff8-3c25c271901b",
              + "b99d8690-693f-4a7d-bedf-08f2a270b2e0",
            ]
          + geo            = [
              + "GB",
            ]

          + github {
              + identity_provider_id = "3054c1ad-9a73-4638-8ebf-1782304d9f76"
              + name                 = "MorrisLAN"
              + teams                = [
                  + "Admins",
                ]
            }
        }
    }

  # module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_macos_teleport will be destroyed
  # (because cloudflare_access_policy.device_policy_macos_teleport is not in configuration)
  - resource "cloudflare_access_policy" "device_policy_macos_teleport" {
      - application_id                 = "841c3752-517b-4601-9a3d-fa907fa06fc3" -> null
      - approval_required              = false -> null
      - decision                       = "allow" -> null
      - id                             = "ef6e75cf-6ab8-4f51-8161-19529e760d29" -> null
      - isolation_required             = false -> null
      - name                           = "Teleport Device Policy (macOS)" -> null
      - precedence                     = 2 -> null
      - purpose_justification_required = false -> null
      - session_duration               = "6h" -> null
      - zone_id                        = "8eaa1d30ab4bcae4d54f9ac6886ae26b" -> null

      - include {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [
              - "b99d8690-693f-4a7d-bedf-08f2a270b2e0",
            ] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null
        }

      - require {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [
              - "20a2ba2e-1f2d-4d6b-94da-e810d845108a",
              - "023b1934-a799-4b40-b7b8-7510f5527b58",
              - "adf5c0d9-521c-4ea6-9ec0-0ee4fcb40571",
              - "63e08031-4127-43b2-9ff8-3c25c271901b",
              - "b99d8690-693f-4a7d-bedf-08f2a270b2e0",
            ] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [
              - "GB",
            ] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null

          - github {
              - identity_provider_id = "3054c1ad-9a73-4638-8ebf-1782304d9f76" -> null
              - name                 = "MorrisLAN" -> null
              - teams                = [
                  - "Admins",
                ] -> null
            }
        }
    }

  # module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_windows_ssh_srv_access_01 will be created
  + resource "cloudflare_access_policy" "device_policy_windows_ssh_srv_access_01" {
      + account_id       = (known after apply)
      + application_id   = (known after apply)
      + decision         = "allow"
      + id               = (known after apply)
      + name             = "srv-access-01 SSH Device Policy (Windows)"
      + precedence       = 1
      + session_duration = "6h"
      + zone_id          = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + device_posture = [
              + "82189582-a53b-47a6-bd21-4dc9b375bd8a",
            ]
        }

      + require {
          + device_posture = [
              + "20a2ba2e-1f2d-4d6b-94da-e810d845108a",
              + "023b1934-a799-4b40-b7b8-7510f5527b58",
              + "e1def9b7-52b5-47c2-9b11-71e02e2c8625",
              + "dd3e9a96-2428-462c-a08f-5ef02772bfa5",
              + "82189582-a53b-47a6-bd21-4dc9b375bd8a",
            ]
          + geo            = [
              + "GB",
            ]

          + github {
              + identity_provider_id = "3054c1ad-9a73-4638-8ebf-1782304d9f76"
              + name                 = "MorrisLAN"
              + teams                = [
                  + "Admins",
                ]
            }
        }
    }

  # module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_windows_teleport will be destroyed
  # (because cloudflare_access_policy.device_policy_windows_teleport is not in configuration)
  - resource "cloudflare_access_policy" "device_policy_windows_teleport" {
      - application_id                 = "841c3752-517b-4601-9a3d-fa907fa06fc3" -> null
      - approval_required              = false -> null
      - decision                       = "allow" -> null
      - id                             = "378474b0-8ad8-496b-a730-e821f7c9b40a" -> null
      - isolation_required             = false -> null
      - name                           = "Teleport Device Policy (Windows)" -> null
      - precedence                     = 1 -> null
      - purpose_justification_required = false -> null
      - session_duration               = "6h" -> null
      - zone_id                        = "8eaa1d30ab4bcae4d54f9ac6886ae26b" -> null

      - include {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [
              - "82189582-a53b-47a6-bd21-4dc9b375bd8a",
            ] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null
        }

      - require {
          - any_valid_service_token = false -> null
          - certificate             = false -> null
          - device_posture          = [
              - "20a2ba2e-1f2d-4d6b-94da-e810d845108a",
              - "023b1934-a799-4b40-b7b8-7510f5527b58",
              - "e1def9b7-52b5-47c2-9b11-71e02e2c8625",
              - "dd3e9a96-2428-462c-a08f-5ef02772bfa5",
              - "82189582-a53b-47a6-bd21-4dc9b375bd8a",
            ] -> null
          - email                   = [] -> null
          - email_domain            = [] -> null
          - everyone                = false -> null
          - geo                     = [
              - "GB",
            ] -> null
          - group                   = [] -> null
          - ip                      = [] -> null
          - ip_list                 = [] -> null
          - login_method            = [] -> null
          - service_token           = [] -> null

          - github {
              - identity_provider_id = "3054c1ad-9a73-4638-8ebf-1782304d9f76" -> null
              - name                 = "MorrisLAN" -> null
              - teams                = [
                  - "Admins",
                ] -> null
            }
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_dex_test.unifi will be destroyed
  # (because cloudflare_device_dex_test.unifi is not in configuration)
  - resource "cloudflare_device_dex_test" "unifi" {
      - account_id = (sensitive value) -> null
      - created    = "2023-12-11T22:57:13.781574Z" -> null
      - enabled    = true -> null
      - id         = "767925bd-58ff-46e0-876f-7ffa417125c5" -> null
      - interval   = "0h30m0s" -> null
      - name       = "UniFi" -> null
      - updated    = "2023-12-11T22:57:13.781574Z" -> null

      - data {
          - host   = "https://unifi.morrislan.net" -> null
          - kind   = "http" -> null
          - method = "GET" -> null
        }
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_ssh_srv_access_01 will be created
  + resource "cloudflare_record" "access_app_ssh_srv_access_01" {
      + allow_overwrite = true
      + comment         = "CNAME to MorrisLAN ZT Tunnel for srv-access-01 SSH"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "srv-access-01-ssh.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "e22b33cc-010f-43d2-9261-73e99b46758c.cfargotunnel.com"
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_teleport will be destroyed
  # (because cloudflare_record.access_app_teleport is not in configuration)
  - resource "cloudflare_record" "access_app_teleport" {
      - allow_overwrite = true -> null
      - comment         = "CNAME to DigitalOcean VPC ZT Tunnel for Teleport" -> null
      - created_on      = "2023-12-26T00:07:41.439718Z" -> null
      - hostname        = "access.morrislan.net" -> null
      - id              = "34098c329765d26376137a953218500c" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-12-26T00:07:41.439718Z" -> null
      - name            = "access.morrislan.net" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - value           = "e22b33cc-010f-43d2-9261-73e99b46758c.cfargotunnel.com" -> null
      - zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b" -> null
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy will be updated in-place
  ~ resource "cloudflare_tunnel_config" "clancy" {
        id         = "e22b33cc-010f-43d2-9261-73e99b46758c"
        # (2 unchanged attributes hidden)

      ~ config {
          ~ ingress_rule {
              ~ hostname = "access.morrislan.net" -> "srv-access-01-ssh.morrislan.net"
              ~ service  = "https://127.0.0.1" -> "ssh://127.0.0.1:4022"

              ~ origin_request {
                  ~ no_tls_verify            = true -> false
                    # (11 unchanged attributes hidden)
                }
            }
          ~ ingress_rule {
              - hostname = "access.morrislan.net" -> null
              ~ service  = "tcp://127.0.0.1:3025" -> "http_status:404"

              - origin_request {
                  - bastion_mode             = false -> null
                  - connect_timeout          = "2m0s" -> null
                  - disable_chunked_encoding = false -> null
                  - http2_origin             = false -> null
                  - keep_alive_connections   = 100 -> null
                  - keep_alive_timeout       = "1m30s" -> null
                  - no_happy_eyeballs        = false -> null
                  - no_tls_verify            = false -> null
                  - proxy_address            = "127.0.0.1" -> null
                  - proxy_port               = 0 -> null
                  - tcp_keep_alive           = "30s" -> null
                  - tls_timeout              = "10s" -> null
                }
            }
          - ingress_rule {
              - service = "http_status:404" -> null
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.cloudflare-zerotrust.module.access_app_ssh_srv_access_01.cloudflare_access_application.application will be created
  + resource "cloudflare_access_application" "application" {
      + account_id                = (known after apply)
      + allowed_idps              = [
          + "3054c1ad-9a73-4638-8ebf-1782304d9f76",
          + "89cdb541-1b94-4fd6-a544-87753f3fa6d2",
        ]
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "srv-access-01-ssh.morrislan.net"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + logo_url                  = "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Terminalicon2.png/768px-Terminalicon2.png"
      + name                      = "srv-access-01 SSH"
      + service_auth_401_redirect = false
      + session_duration          = "6h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.module.access_app_teleport.cloudflare_access_application.application will be destroyed
  # (because cloudflare_access_application.application is not in configuration)
  - resource "cloudflare_access_application" "application" {
      - allowed_idps               = [
          - "3054c1ad-9a73-4638-8ebf-1782304d9f76",
          - "89cdb541-1b94-4fd6-a544-87753f3fa6d2",
        ] -> null
      - app_launcher_visible       = true -> null
      - aud                        = "d7c9ae5c75f8a7cfd5219fdf1908ea79d0dfdc797a3247324f2ac8bb950bba59" -> null
      - auto_redirect_to_identity  = false -> null
      - custom_pages               = [] -> null
      - domain                     = "access.morrislan.net" -> null
      - enable_binding_cookie      = false -> null
      - http_only_cookie_attribute = false -> null
      - id                         = "841c3752-517b-4601-9a3d-fa907fa06fc3" -> null
      - logo_url                   = "https://www.pomerium.com/wp-content/uploads/2023/09/teleport-thumb.png" -> null
      - name                       = "Teleport" -> null
      - service_auth_401_redirect  = false -> null
      - session_duration           = "6h" -> null
      - skip_interstitial          = false -> null
      - tags                       = [] -> null
      - type                       = "self_hosted" -> null
      - zone_id                    = "8eaa1d30ab4bcae4d54f9ac6886ae26b" -> null
    }

Plan: 4 to add, 1 to change, 5 to destroy.

```

</details>
